# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Méthodes de factorisation matricielle pour la génomique des populations et les tests d'association
#+AUTHOR:      Kevin Caye

#+LANGUAGE:  en
#+STARTUP: overview indent inlineimages logdrawer
#+OPTIONS: H:5 author:nil email:nil creator:nil timestamp:nil skip:nil toc:nil ^:nil
#+TAGS: noexport(n) deprecated(d)
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

# #+LaTeX_CLASS: book
#+LaTeX_CLASS: article
#+LATEX_HEADER: \input{notations.tex}

#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler

#  LocalWords:  methylation polymorphism nucleotide Frobenius invertible SNP
#  LocalWords:  preprocessing dataset RidgeLFMM LassoLFMM

#+BEGIN_QUOTE
In Code we trust, all others bring data.
–William Edwards Deming (1900-1993).
#+END_QUOTE

****** Association study of DNA methylation with rheumatoid arthritis (EWAS)
For the EWAS we chose data from a recent association study of DNA methylation with
rheumatoid arthritis (RA) cite:Liu_2013. We retrieve the RA data from Gene
Expression Omnibus (GEO) database (accession number GSE42861). Following
cite:Zou_2014 we filtered out site if its average probe $\beta$ value was above
0.8 are below 0.2. We finally obtain $n = 689$ and $L = 162038$.

#+BEGIN_SRC R :session *ssh krakenator*
  G <- readRDS("~/Projects/Thesis/Data/ThesisDataset/3Article/GSE42861/G.rds")
  dim(G)
#+END_SRC

#+RESULTS:
: [1]    689 162038

For this data set confounding variables (batch effect, age, gender, smoking
status, cell-type composition) are known but we did not use them in methods.
Thus, we can compare methods output with output of method considering explicitly
these variables cite:Rahmani_2016,Zou_2014.

****** Association study of genetic variants with Celiac disease (GWAS)
For the GWAS we chose data from an association study of SNPs with Celiac disease
citep:dubois2010multiple. Before running method we apply classic preprossessing
step with the software Plink cite:Purcell_2007. Firstly, we keep only individual
and SNPs with a proportion of missing value inferior to $5\%$. Then, we filter
out variants with minor allele frequency below $0.05$ and Hardy-Weinberg
equilibrium exact test \pvalue below $1e-10$. After that we filter out
individuals which have identity-by-descent proportion (first by pairs) superior
to $0.08$. Finally, we perform an linkage disequilibrium pruning to obtain SNPs
which are not correlated. The final dataset was of size $n = $ and $L = $.

#+BEGIN_SRC R :session *ssh krakenator*
  G <- readRDS("~/Projects/Thesis/Data/ThesisDataset/3Article/Celiac/G_clumped.rds")
  dim(G)
#+END_SRC

#+RESULTS:
#+begin_example
[1] 15155 94497
#+end_example

We also impute missing value with the sowtware 

